In [1]:
import pandas as pd
import numpy as np

In [2]:
 # buat array
data = np.array([
    [1,4],
    [2,5],
    [3,6]
])
data

array([[1, 4],
       [2, 5],
       [3, 6]])

In [3]:
df = pd.DataFrame(
    data,
    index=['baris1','baris2','baris3'],
    columns=['kolom1','kolom2']
)
df

        kolom1  kolom2
baris1       1       4
baris2       2       5
baris3       3       6

In [4]:
# contoh membuat DataFrame sendiri
# pembuatan data /  data harus seimbang : 
provinsi = ['Kalimantan Selatan','Jawa Barat','Nusa Tenggara Timur']
jumlah_penduduk = [39613493, 29730311, 21944577]

# dictionary / dict
dict = {'Provinsi' : provinsi,
        'jumlah_penduduk' : jumlah_penduduk
}
# konversi ke DataFrame
df_jumlah_penduduk = pd.DataFrame(dict)
df_jumlah_penduduk

              Provinsi  jumlah_penduduk
0   Kalimantan Selatan         39613493
1           Jawa Barat         29730311
2  Nusa Tenggara Timur         21944577

In [5]:
df_ujian = pd.read_csv('StudentsPerformance.csv')
# menampilkan 1000 baris 8 kolom
df_ujian.shape

(1000, 8)

In [6]:
#pd.set_option('display.max_rows', 1000)
#df_ujian

In [7]:
df_ujian.index

RangeIndex(start=0, stop=1000, step=1)

In [8]:
df_ujian.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [9]:
df_ujian.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [10]:
# Menampilkan data sebanyak 5 baris :
df_ujian.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [11]:
# menampilkan info tipe data
df_ujian.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [12]:
# menjelaskan statistik dari data
df_ujian.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [13]:
len(df_ujian) # panjang data
max(df_ujian.index) # maksimal data
min(df_ujian.index) # minimal data
type (df_ujian) # menyajikan tipe data
round(df_ujian, 2) # ini untuk membulatkan

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [14]:
df_ujian['writing score'] # memilih kolom
type(df_ujian['writing score']) # mengetahui tipe data
# df_ujian # menampikan semua kolom 
df_ujian[['gender','writing score']]  # MENAMPILKAN SEBAGIAN KOLOM

     gender  writing score
0    female             74
1    female             88
2    female             93
3      male             44
4      male             75
..      ...            ...
995  female             95
996    male             55
997  female             65
998  female             77
999  female             86

[1000 rows x 2 columns]

In [15]:
df_ujian['language score'] = 70
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70
996,male,group C,high school,free/reduced,none,62,55,55,70
997,female,group C,high school,free/reduced,completed,59,71,65,70
998,female,group D,some college,standard,completed,68,78,77,70
999,female,group D,some college,free/reduced,none,77,86,86,70

In [16]:
# membuat angka 0-1000
language_score = np.arange(0, 1000) # mulai dan jumlah
df_ujian['language score'] = language_score
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,0
1,female,group C,some college,standard,completed,69,90,88,1
2,female,group B,master's degree,standard,none,90,95,93,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,3
4,male,group C,some college,standard,none,76,78,75,4
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,995
996,male,group C,high school,free/reduced,none,62,55,55,996
997,female,group C,high school,free/reduced,completed,59,71,65,997
998,female,group D,some college,standard,completed,68,78,77,998
999,female,group D,some college,free/reduced,none,77,86,86,999

In [17]:
# membuat nilai acak dari 60 - 100, sebanyak 1000
int_language_score = np.random.randint(60,100, size=1000)
df_ujian['language score'] = int_language_score
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,97
1,female,group C,some college,standard,completed,69,90,88,77
2,female,group B,master's degree,standard,none,90,95,93,90
3,male,group A,associate's degree,free/reduced,none,47,57,44,74
4,male,group C,some college,standard,none,76,78,75,96
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,87
996,male,group C,high school,free/reduced,none,62,55,55,66
997,female,group C,high school,free/reduced,completed,59,71,65,98
998,female,group D,some college,standard,completed,68,78,77,78
999,female,group D,some college,free/reduced,none,77,86,86,96

In [18]:
# membuat nilai acak dari 1 - 100 secara acak
np.random.uniform(1,100,size=1000)

array([20.72699216, 91.20597256, 32.37250561, 69.75200286,  2.04229067,
       84.49513874, 35.67838569, 94.84880769,  9.32375147, 10.00727878,
       72.16032068, 60.62455918,  9.02947957, 90.68667952,  9.48222546,
        7.18972488,  6.43561227, 72.54320211, 14.1526265 , 88.36430484,
       55.90507055, 19.87773483, 36.3464109 , 78.20024851, 20.49950658,
       65.57576201, 21.93695896, 98.74049579, 12.82838605, 37.8563921 ,
       92.177444  , 17.83238421, 16.04693232, 82.085358  , 43.61367521,
       54.73954366, 32.34625312, 80.08881261, 41.00703278, 62.22837236,
        9.14117734, 18.44541691, 12.47646956,  6.25468414, 65.79136299,
       29.47141573,  5.89390726, 44.48297071, 92.75065919, 62.70360618,
       33.70591916, 36.500526  , 22.3197544 , 35.9451827 , 82.68266958,
       59.02835953, 80.23662856, 97.68046775, 20.13761087, 32.63923508,
       91.40108258, 39.66438741, 67.41234859, 75.39396478, 56.149861  ,
        2.68057321,  9.26965875, 21.92899134, 50.4567054 , 93.36594548,
       40.83367053, 10.799514  , 23.06067323, 93.12836684, 88.10961101,
       84.96904446, 75.33976936, 35.14160184, 11.16766795, 89.14668361,
       40.67897586,  3.42312336, 23.36341397, 96.80779265, 61.78880906,
       24.82471173, 84.80518054, 76.73074352, 12.4022417 , 14.5426165 ,
        1.98070084, 79.89273043, 43.53780949, 30.02077959, 26.47832788,
       63.08706694, 46.82216822, 19.07393091, 81.95004459,  9.39886962,
       72.60426065, 35.73736009, 15.11931264, 90.86643971, 82.33705494,
       18.75521809, 76.51311223, 83.81096301,  2.37625663, 62.82019575,
       26.12834036, 43.31024932, 67.00270575, 56.90317438,  3.10309071,
       97.42189394, 39.77063469,  8.99324708, 87.94735802, 99.56024794,
       24.41429855, 56.20421   , 68.68671076, 56.54620738, 82.64748319,
       90.07698836, 58.39400209, 30.91994405, 52.30173105, 53.29316401,
       16.84999778, 20.65938261, 54.10870186, 76.11044299, 94.26648537,
       14.33011729, 98.17301489, 45.53050787, 21.70602261, 16.19012395,
       96.09244689, 65.7230968 ,  7.39620608, 68.82330371, 76.5797544 ,
       67.48920303, 99.19234234, 57.50626977, 95.22427626, 74.25005118,
        6.63121927, 85.58336492, 82.79326688, 16.81820037, 90.83519457,
       11.18548174, 45.41331796, 47.15387194, 98.94933566,  8.85168577,
        2.72294404, 99.11380147, 41.98962066,  5.87731509, 96.98281935,
       64.79376868, 43.39505535, 58.21252809, 14.32175372, 62.34053143,
       66.84461074, 98.20215374, 28.54747038, 25.96149627, 99.29280799,
       92.76723215, 28.71213124, 45.1287572 , 42.79154718, 65.71510084,
       77.47506614, 58.59589401, 81.64357152, 31.23548281, 81.65308229,
       72.88787696, 65.45188643, 88.07972153, 63.20929368, 77.03914913,
       23.06752212, 50.23136557, 37.46784188, 22.03430798, 76.72766603,
       14.02397356, 50.31387947, 42.6482226 , 88.22674746, 64.4715482 ,
       61.87933057, 54.83285765, 58.17129347, 34.2715604 , 85.11197644,
       59.05243135, 48.6221221 , 10.36336704, 75.4733259 , 86.24254487,
       15.87468565, 37.99281408, 94.44842954, 85.11097859, 25.85702929,
       91.5952122 , 62.06263746,  7.96004042,  1.63062912, 97.60610974,
        7.28923897, 35.27553951, 73.6784021 , 90.45462993,  7.3342337 ,
       62.23403606, 38.35351175, 27.66118325, 46.88328584, 12.89169319,
       27.85232574, 31.888507  , 98.40573383, 31.90472353, 12.40885849,
       45.70142437, 19.28963123, 18.13716233,  8.26387141,  2.87845792,
       37.30790282, 30.46291184, 64.62651204, 84.9086947 , 39.18777257,
       62.07685249, 95.46532252, 35.03341884, 55.86188451, 97.48136361,
       32.50608441, 15.60595472,  8.97285214, 94.10834506, 78.23883499,
       60.67993018, 29.70235528, 48.30933047, 93.38510398, 60.34651842,
       42.37720953, 99.07965311, 13.26070633, 57.31753619, 60.62880439,
       26.43417494, 46.37669775, 62.28571341, 69.88589871, 78.87237928,
       11.96916731,  5.78272398, 29.14113908, 94.46237332, 13.69747772,
       36.14359679, 34.71041707,  4.31827104, 20.51914687, 94.38281735,
       41.60106245, 36.86253297, 22.7427485 , 82.80202799, 25.77465529,
       61.73439437, 20.54717754, 39.19626692,  5.9380377 , 48.10236011,
       75.4648011 , 13.37884993, 96.75262956, 14.63048247, 34.28630732,
       43.43193257, 74.83584002, 80.07386459, 61.52051184, 42.09823151,
       63.39530484, 38.37816095, 43.01802674,  8.96067133, 59.81132955,
       41.4383063 , 68.08307738, 40.30151548, 32.26430441, 55.13801345,
       98.18697506, 15.2932394 , 41.39117182, 69.28448242, 17.28949037,
       95.00883134, 36.16437252, 94.46740719, 52.06462686, 12.1972478 ,
       20.45485471, 11.68091285, 69.87240298, 29.76647169, 17.5731662 ,
       69.2383792 ,  9.7990527 , 61.85467965, 81.65822642, 49.23867466,
       95.53076814, 51.70494189, 17.75915868, 25.14863161, 44.99088856,
       12.59197949, 96.57374281, 72.31191879, 58.72757514, 64.56611189,
        4.00017801, 75.87024856, 76.2604662 , 52.00097414, 68.19709925,
       83.6083479 ,  4.36090784, 60.78824501, 22.14920142, 94.0644466 ,
        8.77805255, 64.25087448, 30.15167072, 28.94554181, 31.16445516,
       85.19371381, 15.92593148, 21.61564678, 19.25964835, 95.65406787,
       97.42251315,  7.37047276, 39.78853123, 11.10960818, 97.72682736,
       58.4603205 , 13.62511033, 57.89072376,  3.72779436, 89.10785253,
       91.37005211, 95.00276545, 16.4032757 , 66.21407261, 23.96784631,
       31.35026422, 84.51770859, 82.50283413, 98.95168151, 20.45812821,
       33.10042331,  2.13140839, 41.43977355, 24.98774375, 57.79434697,
        9.63051854,  3.80059195, 39.14621169, 67.76345298, 59.47286905,
       96.07710344, 47.21381854, 54.64047425, 82.47243004, 44.62533623,
       38.25104578, 35.97686957, 64.07363487, 34.07953676, 28.90940128,
       76.6308482 , 97.28622931, 41.78575223, 47.29437894, 33.44245218,
       44.81360033, 31.20824974, 38.12148653,  6.05423213, 53.89657901,
       16.45499403, 81.46556606, 31.04711393,  1.3702076 , 34.47815617,
       41.08217181, 98.3795675 , 41.99189521,  1.1648069 , 98.16705645,
       74.41989927, 26.23828212,  4.03296006,  5.18381126, 39.75265536,
       33.76944233, 58.12315644, 93.36931371, 51.92905582, 40.5572074 ,
       16.02457852, 64.78265821, 19.002629  , 61.31063142, 65.96004087,
       60.90586881, 17.17975883, 74.60340593, 55.98009593, 48.02949349,
        4.26050574, 26.97038768, 42.63302769, 41.49702565, 73.18352326,
       65.22445391, 22.22509801,  1.67704189,  7.64759312, 46.58843979,
       28.67546725, 34.89575124, 91.1988194 , 56.03328283, 17.67490565,
       29.63739176, 83.05191725, 61.15995165, 94.16513812, 49.49450694,
       83.77695412, 87.49811415, 65.55172946, 49.36026425,  6.88209275,
       31.99847153,  7.74108516, 38.09195649, 25.08012875, 25.59421449,
       96.90759229, 50.01599495, 22.44482583, 72.54465134, 35.45722873,
       49.15428594, 58.455987  , 76.19125361, 62.01261123, 33.39631229,
        8.15994805, 60.19111734,  7.84569766, 38.73962116, 12.2288394 ,
       19.72892878, 79.08914336, 12.0565903 , 16.7361601 , 83.5211448 ,
       12.50828155, 62.80711589, 59.92201096, 29.17938954, 11.94375543,
       40.83291196, 56.9981358 , 45.2653804 ,  7.25379771, 20.68324909,
       23.28374034,  1.28091084, 35.78806338, 91.48985127, 37.05836523,
       65.06560206, 12.96252463, 33.12067215, 30.76396587,  2.55715981,
       15.89164851, 15.86441374, 64.49151935, 66.53215376, 53.73055472,
       57.93257213, 81.7134258 , 45.33145794, 16.14944723, 28.09846696,
       14.25379361, 83.07745408, 40.71806028, 51.5166917 , 36.95619559,
        1.3596713 , 99.41734329, 84.62510424, 82.49932216, 28.52100208,
       68.44507647, 69.3937751 , 92.03495521, 91.41636115, 46.90547734,
       25.5271071 , 50.60352568, 54.50613276, 41.23089179, 98.42444732,
       47.07571983, 40.68388969, 98.0099048 , 82.18295104, 68.1121294 ,
       77.88499285, 62.56777151, 46.85235162, 25.27278384, 70.39511184,
       15.00333987, 30.42508583, 29.41597782, 33.88763317, 46.79309179,
        1.6967434 , 19.89846596, 74.10675478, 35.43319584,  1.37811229,
       94.89155838, 36.07094759, 36.56295511, 24.21435823, 58.01649635,
       46.09501867, 37.11010883, 86.53099468, 53.09420393, 56.72060151,
       78.03315237, 34.99137396, 11.94332814, 75.68443027, 41.60724854,
       25.9435801 , 18.69282648,  9.88394637, 44.34863484, 85.51724491,
       60.47581796, 40.16743504, 97.74510013, 87.56816206, 55.0513551 ,
       60.24337972, 45.30961401, 99.06575015, 25.9904065 , 54.3926756 ,
       71.61214265, 53.20460907, 45.79764757, 30.54570535, 83.46879941,
       81.06257087, 19.79242078, 32.54025237, 20.77185414, 73.3698987 ,
       92.30496743, 62.93962381, 84.43085243, 93.03284984, 78.14265461,
       81.60869965, 94.96216678, 63.27405507, 86.10878841, 70.1435848 ,
        2.04443952, 55.86497803, 99.50054677, 84.85787908, 55.50735407,
       15.84983339, 30.01618559, 72.67959986,  4.81902595, 58.48361909,
       19.49980839, 21.98320943, 20.09718082,  3.82827175, 23.51917845,
       61.79034138, 25.44059924, 32.44783572, 67.7479621 , 17.4273304 ,
       19.63384003, 31.73910175, 53.47208562, 45.74418753, 51.81474953,
        1.01020809, 21.69322924, 34.86943373, 75.4747875 , 29.80302317,
       21.07692385, 27.50406313, 87.34958579, 72.08763861, 18.12510948,
       10.59763325, 20.60562678, 22.10225351, 41.16292836,  3.7605441 ,
       20.18881369, 63.87629619, 82.10792846, 78.76187202, 63.63805416,
       77.57240385, 53.86494285, 59.91428915, 79.48136951,  8.96452134,
       32.92590123, 58.67851376, 97.77645605, 52.6372389 ,  3.58713236,
       74.59496905, 94.44765523, 68.71038505, 87.52434029, 20.23074893,
       64.74835968, 78.66568724, 51.74232084, 46.11190751, 67.3501549 ,
       95.65040182, 19.54497672, 32.55233222, 25.4854733 , 20.74371364,
       78.71204121, 65.42064219, 40.62455484,  7.05778305, 23.91958505,
       69.19068815, 83.79527185, 40.40983818, 98.1772867 , 20.77379422,
       48.01836259, 85.30728558, 44.93375877, 30.7775409 , 73.0424114 ,
       52.6870914 , 85.60557536, 83.92399177, 26.00704603, 92.28664046,
        7.74363236, 56.70172876, 28.13255266, 66.63511043, 72.76205384,
       77.53330345, 72.7079025 , 27.30114022, 66.92284347, 29.72552059,
       56.46829699, 12.2386552 , 52.13334627,  7.36437251, 82.65848069,
       64.56000792, 64.82036171,  3.11136282, 88.58613884,  5.12187938,
       85.99599465, 92.80892609, 71.78094378, 28.35865806, 27.66366884,
       60.12485167, 97.2067028 , 77.68335521, 82.84764593, 71.25417915,
       82.08502758, 64.0069963 , 70.85537737, 31.26590698, 14.38571286,
       67.28190913, 60.54568874, 40.75863949, 87.71613718, 87.44499011,
       54.25569762, 51.4554879 , 45.66622385, 22.73658282, 19.96245341,
       19.13831781, 58.464516  , 95.51641694,  5.81883368, 99.57563335,
       93.69896968, 81.00028001, 18.64077867, 53.15726761, 22.01691603,
       85.84935749,  1.49077607, 41.89035458, 92.82573318, 59.59953092,
       40.05955481, 41.29130822, 43.27664467, 13.61026502, 59.77178324,
       81.35312901, 81.23092044, 58.91580488, 59.54775771, 14.07922097,
       97.81282026, 29.03233232, 66.63043271,  4.28155782, 72.04666482,
       31.42743422, 62.13816437, 27.20985742, 82.23246417,  4.53442634,
       17.776301  , 50.03968342,  8.05837277, 37.31050895, 47.27830428,
       18.5430002 , 86.8625537 , 65.80065995, 63.01207867, 22.01399517,
       65.38737015, 63.68008521, 66.46474619, 45.37899933, 51.58643936,
       86.72757191, 59.51987895, 34.07673983, 31.1309432 , 12.07196688,
       49.77438472, 82.36087892, 20.86040326, 96.84598512, 68.3896601 ,
       32.31433575, 36.44871588, 41.55838566, 49.97292385, 12.35097412,
       86.36872865, 25.11910785, 60.26108676, 72.0141135 , 88.68749437,
       26.61560946, 53.30157363, 50.54535229, 48.8521369 , 51.66768612,
       29.01467215, 74.16225791, 62.93906877,  5.3242738 , 36.21910488,
       49.41994027, 32.02150626, 18.34905139, 61.18104182, 82.40561913,
        6.2158683 , 82.20732714, 54.03852477, 36.26446743,  9.71607208,
       16.87338354,  9.86166189, 67.62161264, 40.87905515, 37.64084431,
        2.59598357, 19.82378388, 29.67724505, 41.72506412, 86.25116582,
       16.29568024, 37.7444292 , 23.09017157,  5.03956496, 80.97351033,
       40.63490095, 70.59834494, 85.30265163, 38.96274167, 23.7419785 ,
       87.71968291, 57.72563616, 14.3092987 , 89.65467551, 64.80019286,
       81.97758437, 41.97346855, 76.80045732, 62.71462   , 72.99523459,
       77.67841197, 59.74656526, 22.48845924, 11.08760281, 92.50266168,
       35.7230277 , 96.90829936,  7.74762637, 34.40140973,  7.43553399,
       10.22639842, 79.72013928, 50.97069795, 32.79779844, 85.07965427,
       89.78051457, 34.26324101, 19.29983508,  7.36730672, 96.84001145,
        4.77010994, 50.17826039, 87.42353179, 77.34740754, 43.09751096,
       71.34268746, 94.27038802, 40.97349452, 32.62715197, 12.05786435,
       39.40042364, 25.74779438, 78.10568447, 66.48916013,  7.80905521,
       84.56359445, 88.87274369, 56.61210327, 62.83884176, 84.68187691,
       60.91512457, 39.98521394, 63.47287738, 95.5422665 , 14.77838066,
       74.07827209, 97.45766945, 24.1976017 , 79.21884336, 35.08738592,
       43.47805872,  2.09711513, 33.5517483 , 54.25825514, 22.09493972,
       17.53588273, 84.13788594, 46.92093182, 22.82977856, 93.72369676,
       98.6031669 , 73.71724626, 31.75630373, 48.2828772 , 86.77146449,
       71.28304507, 11.19803847, 38.07054604, 94.74736899,  7.11115597,
       28.11281333, 92.44185358, 81.14629398, 11.38689926, 45.93309763,
       99.88837008, 34.90639847, 67.57906196,  5.16116161, 18.37382419,
       28.17755799, 60.61526317, 27.8928991 , 80.32367578, 99.89565903,
       41.42991067, 50.21421647, 32.43049074, 19.21220084, 72.97273988,
       81.39095295, 76.63893288, 19.87902194, 15.80487992, 32.55434544,
       12.67730375, 83.64482299, 45.34485921, 21.60141362, 55.21635201,
       59.23515595, 57.11636958, 75.76306608, 14.76392263, 59.20339014,
       93.50693201,  4.2502249 , 36.31424051, 55.09981743, 24.12296992,
       12.64775915, 89.60510539, 83.77002797, 51.91841805, 99.61861944,
       29.46595717, 52.69344749, 12.40402027, 58.41925552, 24.09665565,
       23.05425654, 70.47115035, 52.0450671 , 27.4014425 , 30.02568377,
       94.81726064, 34.34186553, 46.54049832, 27.91964471, 61.13509667,
       83.83865207, 38.18010275,  7.8072964 , 63.85529063, 83.68168996])

In [19]:
score1 = np.random.uniform(1,100, size=1000)
score2 = np.random.uniform(1,100, size=1000)

score1

array([85.68791483, 26.8645178 , 89.380391  , 74.94410851, 11.04501406,
       14.07914229, 42.99102959,  5.11290383, 98.33098672, 55.1825853 ,
       64.82739542, 44.0300885 , 52.68831793, 60.30260181, 46.98884148,
       35.08172828, 23.81808741, 22.32673529, 88.8352854 , 64.17561136,
        2.34500911, 24.77633248, 59.24344249, 99.47188754, 86.08298409,
       61.69962126, 61.88688931,  6.82531595, 69.63978306, 36.06258453,
        1.42075455, 72.65129444, 85.85796185,  9.72450332, 95.82094541,
       44.59269411, 27.31651386, 87.49950091, 70.22056976,  6.29100152,
        3.65063158, 75.28717536, 99.98618448, 95.18017366, 38.88058009,
        4.32870441, 45.3842698 , 23.53601598, 82.09208524, 52.60089111,
       21.73800777, 26.53710801, 81.76518669, 18.15452148, 42.39969648,
       16.11238579, 33.10682171, 12.42332386, 11.21931629, 22.04581453,
       83.07616958, 35.51419051, 40.27335369, 73.45629173, 30.07328726,
       91.82696155, 91.36052075, 52.70307567, 32.60729007, 16.55811711,
       46.53028759, 52.01551667, 88.73105986, 34.40092705, 19.97179362,
       40.43084772, 42.25473241, 82.46723781, 69.40047604, 55.8011964 ,
       80.84911402, 23.90470254, 37.04726714, 32.90460839, 20.73908522,
       20.01532687, 43.24553948, 36.02828776, 21.36974841, 34.75283082,
       54.20120522, 26.19636448, 94.48833082, 18.41114062, 23.26404049,
       43.40663606,  4.63957357, 55.3415191 , 60.3584604 , 50.1652975 ,
       20.99875561, 84.8123868 , 28.59608171, 64.65394071, 71.03020043,
       10.52634305, 62.37562159, 94.58052316, 53.66081836, 21.70620112,
       87.84394032, 25.44913924, 96.28735812, 30.54787556, 84.71969561,
       34.90640672, 90.3933091 , 24.81831736, 46.46440801, 31.6083219 ,
       36.74000619, 10.80344405, 43.01809472, 82.06010611, 42.11440337,
       12.21080852, 31.7269902 , 75.05628065, 17.47078342, 41.77362143,
       72.85570586, 33.19219343, 67.57894641, 19.28992549, 10.97652896,
       41.33995233,  8.48720927, 24.81020508, 71.51090143, 30.80441946,
       78.25979765, 56.57493026, 86.15337617, 40.0786052 , 74.65228386,
        4.52942936, 20.53418582, 18.50192268, 56.4987409 , 56.88435593,
       72.81242684, 82.97154405, 22.90462672, 69.8846702 , 39.06659409,
       82.99981368, 59.45318743, 25.59222093, 30.36137924, 35.35309618,
       44.46398263, 20.35776507, 69.98339671, 72.14209799, 85.94300328,
       21.78141204, 20.79932322, 65.71443494, 26.57261915,  4.49288625,
       17.66448446, 62.51842297, 46.22562524,  8.2514838 , 82.7661987 ,
       90.63733177, 64.18259282, 13.83098979, 44.59547477, 78.46263637,
       57.97150809, 43.04632939, 89.31262665, 49.65600033, 24.36260084,
       88.66054066, 71.96466455, 16.44353118, 26.88283391, 11.68083352,
       76.27704715, 13.57533531, 24.50963258, 51.26342977, 87.23833716,
       78.93946473, 90.94006249, 66.16852198, 59.79506875, 55.55027579,
       97.50146335,  4.62322364,  7.12994397, 21.19025739, 13.71281457,
       12.90333137, 80.0553488 , 34.84254397, 70.33287727,  2.29369917,
       11.23782532, 69.79427395,  5.54398488, 40.47212542, 51.85211729,
       75.37705108, 76.72913877, 82.82547555,  9.11137461, 43.12084448,
       71.95793063, 38.8726903 , 86.94336325, 40.53426122, 56.20032839,
       69.16299843, 97.78195768, 86.46186371, 91.8626106 ,  7.79768526,
       13.84321414, 86.24835297,  8.01269121, 69.55698729, 68.83123375,
       73.10292452,  9.86690664,  3.4207165 , 82.40832595, 91.32528908,
       47.79665588, 20.73085984, 99.81680125, 93.4619302 , 43.26389479,
       99.23688835, 42.13955334, 38.58290338, 62.09542539, 32.42254228,
       14.8198049 , 67.26641642, 84.87985475, 55.49702612, 15.13084203,
       25.07378572, 70.71952991, 27.77132527, 19.38073523, 33.79166526,
       77.40093941, 52.02944405,  6.23299151, 23.64447923, 41.22064379,
       38.08698806, 75.24816447, 90.76566328, 60.08838652,  4.68948357,
        8.05002322, 89.90796723, 74.4127374 , 72.09657836, 98.48629825,
       53.8421839 , 49.17667795, 23.25318638,  5.05233712, 56.12370148,
       37.25243263, 97.2561568 , 37.60363024, 17.28652688, 13.99982697,
        6.84896438, 96.14479589, 36.24516985, 15.2450717 , 32.06018308,
       50.96895847, 58.79042286, 21.81807766, 69.21785633, 43.7362188 ,
       63.10650805, 45.85242944, 50.28847417, 33.2777372 , 42.32420602,
       72.05404329, 96.27508341, 86.10267206, 48.9733505 , 45.31147398,
       92.3620013 , 58.1592509 , 83.30022604,  7.42319988, 22.68704322,
       29.18757316, 39.95191709, 85.79427833, 67.77587821, 31.63832837,
        8.14525488, 76.95889275, 52.411303  , 77.1565928 , 75.21784282,
       20.31480711, 92.16889048, 76.37362177, 27.95062622, 24.51584175,
       42.98759119, 51.08805691, 10.10492521, 19.46473157, 92.98315907,
       39.18437245, 27.20711867, 47.38901424, 37.0538947 , 98.46000119,
       38.64931445, 27.92960558, 87.95720672, 50.26400103, 23.72671001,
       25.19019985,  4.24647376, 24.04249371, 82.55568644, 96.75472144,
        9.18065837, 57.4120228 , 72.84501464, 18.19860733, 68.12583128,
        5.75685317, 91.85480919, 66.27634816, 60.74719429, 75.92456406,
       88.91887425, 52.12425595, 69.55773767, 19.87004479, 60.61317968,
       99.93766703, 83.19659716,  3.39170574, 97.25978308,  9.79808215,
       24.67468321, 14.62042781, 66.45225173, 17.63468657, 31.7742247 ,
       87.39419134, 33.35988048, 95.37723096, 71.75933164,  5.37365231,
       25.34109795,  2.94976033, 10.16400999, 62.75292512, 38.31234058,
       65.27233925, 83.22237351, 13.96976353, 77.71183276,  2.08918294,
       11.87565975, 18.79306564, 15.40863111, 40.94938425, 19.29733987,
       47.64801178, 27.13544683, 97.12823646, 71.82239473, 58.9372781 ,
        5.39980519, 31.55333157, 77.0283366 ,  8.11885163, 73.33049515,
       85.19396877, 46.45859252, 54.54917507, 56.41238881, 38.93245718,
       23.44468068, 82.14834746, 41.8426374 , 81.90462096, 61.57039839,
       42.73343892, 58.57621812, 60.36577361,  3.54812604, 85.85688101,
       78.64331057, 70.1509572 , 49.51322826, 40.26240956, 27.34106468,
       58.74601596,  9.01796226, 48.23477198, 97.30491504, 28.1138676 ,
       33.83759793, 73.87948128, 17.6551377 , 66.49216676, 17.86481509,
       83.71183043, 82.9024602 , 62.84250301, 43.65120094, 51.45011526,
       76.67118347, 38.7577178 , 75.97221458, 57.4226698 , 60.07817221,
       23.39212455,  3.03958016, 23.1903088 , 10.83205497, 75.25058938,
       25.16429569, 97.99048097, 46.90592821, 17.4358574 , 86.80192965,
       65.01432871, 35.49139831,  8.40740684, 98.13854372, 27.03073345,
       37.68846491, 40.66576577, 43.1075421 , 27.33945686, 58.58995275,
       18.06734768, 85.44928045, 85.7781638 ,  5.82849915, 63.67672247,
       97.70839182,  7.36759875, 67.52649761, 57.69474344,  6.0010756 ,
       72.04661607, 47.20282162,  8.67825548, 74.01963364, 77.88803281,
       55.27552258, 38.89310784, 73.01075567, 47.41350307,  2.30236235,
       54.30511404, 18.59746291, 51.92060668, 61.60124103, 57.55884699,
       25.0905327 , 60.98205844, 86.42502093, 12.32800116, 55.28721321,
        3.38083998, 58.5509748 ,  6.43893912, 30.09643594, 47.60663194,
       93.7169369 ,  2.53405569, 40.33389784, 22.37468976,  4.84544774,
       74.24775135, 92.64555025, 16.56962907, 43.50734709,  2.349459  ,
       39.61195875, 58.75442812, 43.59181025, 71.37544458, 37.97516074,
        2.1733086 , 88.63510831, 96.7969872 , 82.9733399 , 42.18371011,
       70.90086914, 60.43304346, 32.02564693, 34.02013785, 18.76767868,
        8.35883421, 60.77989332, 12.60865691, 70.00854009, 57.93852939,
       23.06596163, 54.10660081, 35.56575013, 17.58152448, 73.23552699,
       70.76525381, 44.51835591, 35.43832498, 89.68935844, 96.14537952,
       69.07605551, 13.06711167, 30.16189944, 24.49139631, 64.80456716,
       48.92335512, 18.43978374, 52.49427455, 88.5318062 , 74.78360335,
        6.46840502, 99.41317502, 86.49003566, 39.56651026, 57.50747428,
       81.20786177, 71.43562435, 77.83192085, 92.47017589,  8.6916892 ,
       16.69866549, 95.73327121, 75.8572505 , 70.37855666,  7.93283732,
       56.85632975, 21.23667603, 64.34645234,  6.42282498, 38.49965702,
       31.29578505, 58.5124468 , 43.91999431, 81.12083065, 30.80246823,
       30.89891925, 39.99688423, 67.71458352, 53.06420686, 18.29872808,
        9.8676238 , 62.64759624, 81.18727288, 85.57140672, 14.82476584,
       75.01856575,  8.64609569, 68.06553701, 89.89386395, 74.36365792,
       97.10448966, 25.26093195, 75.10260914, 42.08324678, 36.22073853,
       17.36266385, 50.57896124, 20.97478827, 84.30529715, 51.79837154,
       25.26903626, 16.6493055 , 32.29807916, 59.36598892, 17.25767966,
       50.93118138, 95.6276562 , 62.1646486 , 61.25734301, 64.90273067,
       83.83781609, 96.12359269, 46.21474373, 31.14613196, 16.6850356 ,
       27.19639112, 40.52507911, 69.75108677, 94.1585661 , 89.17216017,
       73.37478896, 80.84737379, 35.41996916, 38.20963089, 25.66472295,
       34.40487917, 60.45648127, 75.96567246, 64.70004686, 96.17330676,
       72.37322036, 61.94029262, 24.23966869, 44.82071042, 38.64595817,
       92.76646146, 22.97733131, 18.65365529, 91.32386087, 19.8304408 ,
       19.03249264, 18.11888969, 42.84838215,  1.77787862, 82.32081696,
       97.51172857, 75.50585562, 83.92345719, 20.03668036, 43.93340004,
       66.86818461,  8.30625972,  3.55756269, 94.91473158, 29.49539201,
       76.68342546, 38.60969884, 41.17899109,  8.31468318, 50.77877803,
       60.01371927,  3.0928905 , 24.74514647, 23.88127165, 73.32043913,
       88.2359435 ,  8.64550522, 60.5998819 ,  9.60670073, 36.24971976,
       93.05908954, 54.01488883, 24.23881838, 54.07404033, 13.5314302 ,
       12.0620073 , 84.65611346, 90.24109853, 82.21659342, 90.02381058,
       94.48504671, 53.34579207, 16.87728026, 33.55811508, 26.47862525,
       60.31843561, 13.81944703, 90.46199765, 56.96080641, 70.46378315,
       43.97281381, 68.29334469, 99.56828166, 59.43847997, 17.21377939,
       19.01167397, 54.47049405, 50.13623853, 65.16560796, 13.98914614,
       72.63783532, 44.88085488, 96.33788811, 78.80924101, 67.94919509,
       77.33300196, 90.33571359, 36.1800102 , 68.35880076, 55.06053474,
       17.00346601, 41.00303337, 90.4060844 , 60.67801226,  2.00703688,
       49.38168656, 41.52718716, 50.83268576, 90.91091154, 96.11044754,
       63.28025069, 56.18670644, 27.48207884, 83.13218532,  8.16850771,
       44.95939329, 95.5769639 , 88.95234893, 35.63965078, 44.16995469,
       21.54533168, 98.66427257, 43.86693539, 93.60071312, 48.08678955,
        9.17211453, 14.29175359, 56.24896207, 13.97178033,  6.59022892,
       51.47148868, 36.85540188, 25.4457614 , 94.03557404, 81.59161609,
       45.3028408 , 95.44634639,  6.89104459, 51.92968134,  2.8673617 ,
       37.93690889, 88.17143446, 12.23876587, 22.33775923, 66.26957595,
       80.51438936, 82.91017591, 29.64728817, 92.84679657, 37.801282  ,
       42.94048324, 57.70798145, 74.21100884, 51.70547335, 14.77520135,
       50.59704034, 19.59612928, 38.65925954, 39.59556866,  6.08629612,
       73.63138209, 86.49394302, 21.59966725, 85.76910711, 60.08146089,
       91.82072968, 69.86708494, 95.20921132, 39.12161491, 90.81029777,
       89.71679448, 77.38803735, 87.03996159, 16.69877913, 33.98685111,
       27.94905334, 47.48259908, 37.53153989, 68.67473588, 79.34745967,
        2.59255273,  8.15070792, 36.55563717, 22.03984191, 10.63901585,
        2.89728156, 39.71717422,  5.73459873, 83.24516449, 53.06412743,
       68.07724397, 87.60213124, 33.4496388 , 86.65759562, 70.56756111,
       21.62885518, 17.87698397, 18.39181184, 11.64225899, 37.07891766,
       81.20300772, 54.26979557, 39.828242  , 15.05388678, 36.37147991,
       42.80015363, 46.44860621,  9.6374607 , 61.99688262,  4.25114365,
       19.04433172, 48.3124624 , 21.67595205, 50.72368402, 38.15575851,
       85.71481053, 48.97052067, 82.67946588, 32.12006741, 78.63334425,
       12.20586501, 78.39111161, 15.76059311, 97.8759775 , 87.9396907 ,
       69.20937349, 54.68689604, 38.83274886, 22.50494499, 32.40487611,
       66.243067  , 15.71247674, 44.28819969, 19.69247893, 11.13118435,
       43.28112841, 55.37289191, 17.43230368, 56.35060066, 49.90174459,
       55.40236101, 83.13931569, 26.87718699, 39.6053915 , 12.64397807,
       92.07825423, 88.1138741 , 26.16685359, 17.40560797, 51.28844461,
       56.81329494, 79.14210959, 63.86437319, 51.74865127,  5.60469493,
       22.05043221, 40.18954459, 43.5221411 , 49.89847269, 59.43830127,
       77.61666081, 52.89399308, 81.96506692, 67.05171049, 23.7702252 ,
       98.59633023, 18.94381099, 64.4909814 , 29.044419  , 27.41584652,
       38.68957619, 66.46614272, 73.73655951, 38.78154715, 76.82819619,
       20.59115526, 74.61544421, 12.34681177, 33.11656297,  9.19377802,
       27.09775987, 30.81625161, 29.32492618, 19.20072148, 56.36620116,
        7.7176631 , 58.46695884, 28.85394384, 90.19560053, 86.61231104,
       76.88792655,  4.24876316, 14.80741275, 37.38043223, 89.0653081 ,
        2.73662127, 73.32641403, 40.4894224 , 73.62312509, 72.32868255,
       19.69531954, 89.21102555, 12.38527478, 51.28015886, 14.02306812,
       46.32900807, 67.07105134,  2.37578195, 52.76069184, 24.56043475,
       41.3928245 , 63.55957669, 61.95818782, 62.07799488, 60.35385545,
       67.56767124, 44.07353578, 63.16048927, 28.23340573, 16.11599956,
       95.41852653, 50.68922646, 95.96958315, 66.06700081, 23.17459477,
       71.08747266, 55.25048409, 75.8815848 , 18.98741321, 76.94578584,
       49.38296535, 69.98488213, 49.95560756, 20.46945796, 63.15401925,
       85.10332138, 68.16010227, 73.38097697, 71.80918005, 52.98279303,
       94.88261463, 15.5258005 , 28.69032591, 87.60145315, 53.8345274 ,
       78.07528015, 12.83451042,  5.3127297 , 25.8476825 , 71.2907318 ,
       46.61932757, 14.2783169 ,  1.75488897, 46.70119478, 60.53170303,
       20.37595255, 31.76409674, 53.29267388, 13.28023347, 46.73668339,
       45.04321602, 45.48494864, 40.96231314, 12.67391235, 54.19813526,
       16.75381061, 23.55759714, 25.59110438, 10.66110319, 81.08120414,
       34.69256047,  5.13052084,  2.8372542 , 79.28566504, 51.19678003,
       28.23833589, 82.42796908, 92.55237987, 79.95506704, 27.99644671,
        9.83756441, 14.00782337, 56.13495241, 98.97009809, 33.90350367,
        3.884141  , 97.27009248, 84.09679221, 85.29083595, 47.0413704 ,
       98.26788352, 66.82399767, 14.97644069, 91.33670456,  6.47913199])

In [20]:
series1 = pd.Series(score1, index = np.arange(0, 1000))
series2 = pd.Series(score2, index = np.arange(0, 1000))

series1

df_ujian = df_ujian.assign(score1 = series1, score2 = series2)
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,97,85.687915,46.515553
1,female,group C,some college,standard,completed,69,90,88,77,26.864518,3.515408
2,female,group B,master's degree,standard,none,90,95,93,90,89.380391,34.382874
3,male,group A,associate's degree,free/reduced,none,47,57,44,74,74.944109,59.344626
4,male,group C,some college,standard,none,76,78,75,96,11.045014,19.201374
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,87,98.267884,95.335339
996,male,group C,high school,free/reduced,none,62,55,55,66,66.823998,44.111542
997,female,group C,high school,free/reduced,completed,59,71,65,98,14.976441,90.178591
998,female,group D,some college,standard,completed,68,78,77,78,91.336705,23.044776
999,female,group D,some college,free/reduced,none,77,86,86,96,6.479132,15.337691

In [21]:
#df_ujian.insert(1,'test 3', series1)
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,97,85.687915,46.515553
1,female,group C,some college,standard,completed,69,90,88,77,26.864518,3.515408
2,female,group B,master's degree,standard,none,90,95,93,90,89.380391,34.382874
3,male,group A,associate's degree,free/reduced,none,47,57,44,74,74.944109,59.344626
4,male,group C,some college,standard,none,76,78,75,96,11.045014,19.201374
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,87,98.267884,95.335339
996,male,group C,high school,free/reduced,none,62,55,55,66,66.823998,44.111542
997,female,group C,high school,free/reduced,completed,59,71,65,98,14.976441,90.178591
998,female,group D,some college,standard,completed,68,78,77,78,91.336705,23.044776
999,female,group D,some college,free/reduced,none,77,86,86,96,6.479132,15.337691

In [22]:
print (df_ujian['math score'].sum())
print (df_ujian['math score'].count())
print (df_ujian['math score'].mean())
print (df_ujian['math score'].std())
print (df_ujian['math score'].max())
print (df_ujian['math score'].min())
df_ujian.describe()

66089
1000
66.089
15.16308009600945
100
0

,math score,reading score,writing score,language score,score1,score2
count,1000.00000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000
mean,66.08900,69.169000,68.054000,80.28500,48.825595,52.865398
std,15.16308,14.600192,15.195657,11.68479,28.291828,28.176487
min,0.00000,17.000000,10.000000,60.00000,1.420755,1.011685
25%,57.00000,59.000000,57.750000,70.00000,23.622759,29.479681
50%,66.00000,70.000000,69.000000,81.00000,47.401259,54.469512
75%,77.00000,79.000000,79.000000,90.00000,73.136075,75.994176
max,100.00000,100.000000,100.000000,99.00000,99.986184,99.991934

In [23]:
df_ujian['rerata'] = (df_ujian['math score'] + df_ujian['reading score'] + df_ujian['writing score']) /3
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2,rerata
0,female,group B,bachelor's degree,standard,none,72,72,74,97,85.687915,46.515553,72.666667
1,female,group C,some college,standard,completed,69,90,88,77,26.864518,3.515408,82.333333
2,female,group B,master's degree,standard,none,90,95,93,90,89.380391,34.382874,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,74,74.944109,59.344626,49.333333
4,male,group C,some college,standard,none,76,78,75,96,11.045014,19.201374,76.333333
...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,87,98.267884,95.335339,94.000000
996,male,group C,high school,free/reduced,none,62,55,55,66,66.823998,44.111542,57.333333
997,female,group C,high school,free/reduced,completed,59,71,65,98,14.976441,90.178591,65.000000
998,female,group D,some college,standard,completed,68,78,77,78,91.336705,23.044776,74.333333
999,female,group D,some college,free/reduced,none,77,86,86,96,6.479132,15.337691,83.000000

In [24]:
# untuk menghitung nilai
df_ujian['math score'].value_counts()

math score
65    36
62    35
69    32
59    32
73    27
      ..
24     1
26     1
19     1
23     1
8      1
Name: count, Length: 81, dtype: int64

In [25]:
# untuk menghitung nilai 
df_ujian['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [26]:
# untuk menghitung nilai dengan tanpilan ternormalisasi
df_ujian['race/ethnicity'].value_counts(normalize=True)

race/ethnicity
group C    0.319
group D    0.262
group B    0.190
group E    0.140
group A    0.089
Name: proportion, dtype: float64

In [27]:
# pembuatan 2 digit
df_ujian['race/ethnicity'].value_counts(normalize=True).round(2)

race/ethnicity
group C    0.32
group D    0.26
group B    0.19
group E    0.14
group A    0.09
Name: proportion, dtype: float64

In [28]:
# urut berdasarkan 1 kolom
df_ujian.sort_values('math score')
# urutan terbalik atau tidak
df_ujian.sort_values('math score', ascending=False)
# urutan berdasarkan 2 kolom atau ascending berarti
df_ujian.sort_values(['math score','reading score'],ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2,rerata
149,male,group E,associate's degree,free/reduced,completed,100,100,93,93,56.884356,11.834712,97.666667
458,female,group E,bachelor's degree,standard,none,100,100,100,94,27.339457,22.063410,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,69,63.559577,75.416474,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,94,53.292674,29.760472,100.000000
625,male,group D,some college,standard,completed,100,97,99,63,72.373220,48.063366,98.666667
...,...,...,...,...,...,...,...,...,...,...,...,...
145,female,group C,some college,free/reduced,none,22,39,33,82,4.529429,66.186771,31.333333
787,female,group B,some college,standard,none,19,38,32,74,36.555637,65.151130,29.666667
17,female,group B,some high school,free/reduced,none,18,32,28,64,22.326735,35.249050,26.000000
980,female,group B,high school,free/reduced,none,8,24,23,99,28.238336,58.537768,18.333333
59,female,group C,some high school,free/reduced,none,0,17,10,79,22.045815,68.771075,9.000000

In [29]:
import random
new_index = np.arange (0, 1000)
random.shuffle(new_index)# mengacak urutan
df_ujian ['new_index'] = new_index # untuk menambah kolom 
df_ujian.set_index('new_index', inplace=True) # untuk membuat new index sebagai index baru
df_ujian
df_ujian.sort_index()
df_ujian.sort_index(ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2,rerata
new_index,,,,,,,,,,,,
999,female,group A,some college,standard,none,54,63,67,76,81.081204,75.156298,61.333333
998,male,group D,some high school,standard,completed,77,68,69,64,63.154019,59.015324,71.333333
997,female,group D,bachelor's degree,standard,none,89,100,100,77,16.753811,49.675005,96.333333
996,male,group D,high school,standard,none,54,52,52,74,15.130842,32.171518,52.666667
995,male,group B,master's degree,free/reduced,none,49,53,52,90,69.983397,47.421366,51.333333
...,...,...,...,...,...,...,...,...,...,...,...,...
4,male,group D,bachelor's degree,standard,completed,68,74,74,99,84.812387,75.421079,72.000000
3,female,group C,bachelor's degree,free/reduced,completed,74,86,89,92,54.686896,47.509947,83.000000
2,female,group C,high school,free/reduced,none,36,53,43,73,35.565750,64.696055,44.000000
1,female,group E,associate's degree,free/reduced,completed,57,68,73,70,68.077244,71.059326,66.000000
0,female,group C,associate's degree,standard,completed,67,84,86,86,97.501463,56.188274,79.000000

In [30]:
df_ujian.rename(columns={
    'math score' :'MS',
    'reading score' : 'RS',
    'writing score ': 'WS'                    }
, inplace=True)
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,writing score,language score,score1,score2,rerata
new_index,,,,,,,,,,,,
411,female,group B,bachelor's degree,standard,none,72,72,74,97,85.687915,46.515553,72.666667
917,female,group C,some college,standard,completed,69,90,88,77,26.864518,3.515408,82.333333
7,female,group B,master's degree,standard,none,90,95,93,90,89.380391,34.382874,92.666667
417,male,group A,associate's degree,free/reduced,none,47,57,44,74,74.944109,59.344626,49.333333
174,male,group C,some college,standard,none,76,78,75,96,11.045014,19.201374,76.333333
...,...,...,...,...,...,...,...,...,...,...,...,...
95,female,group E,master's degree,standard,completed,88,99,95,87,98.267884,95.335339,94.000000
169,male,group C,high school,free/reduced,none,62,55,55,66,66.823998,44.111542,57.333333
653,female,group C,high school,free/reduced,completed,59,71,65,98,14.976441,90.178591,65.000000
516,female,group D,some college,standard,completed,68,78,77,78,91.336705,23.044776,74.333333
118,female,group D,some college,free/reduced,none,77,86,86,96,6.479132,15.337691,83.000000